#присваиваем х число 67.
x = 67
#задаём условие если х меньше 1 или х больше 100
if x < 1 or x > 100:
#написать ошибка число вне диапазона
    print("oshibka chislo vne diapazona")
#условие если х больше 90
elif x >= 90:
#написать оценка: А
    print("ocenka: A")
#условие если х больше 75
elif x >= 75:
#написать оценка: В
    print("ocenka: B")
#условие если х больше 60
elif x >= 60:
#написать оценка: С
    print("ocenka: C")
#Условие если остальные условия не подходят
else:
#написать оценка D
    print("ocenka: D")
