#присваиваем n число
n = 6

#Проверяем равно ли n единице
if n == 1:
     #Если n = 1, факториал равен 1
    print(1)
else:
    #Переменная chislo будет хранить результат вычисления факториала
    chislo = 1
    # Цикл for проходит по всем числам от 1 до n включительно
    for i in range(1, n + 1): 
        #На каждом шаге умножаем текущее значение chislo на i
        chislo *= i  
        #chislo содержит факториал числа n (n!)
    print(chislo)  

#Граничные случаи:
#n = 1 — минимальное значение. Произведение равно 1.
#Большие значения n — например, 1000 или больше, чтобы проверить, как программа работает с большими числами.

#Объяснение корректности:
#При n = 1, произведение возвращается как 1, что является корректным результатом.
#Для других значений, алгоритм корректно умножает числа от 1 до n, что будет работать без ошибок, так как Python поддерживает произвольную точность чисел.

#Возможные ошибки:
#Переполнение: если использовать типы данных с фиксированным размером (например, int в C++), произведение чисел может выйти за пределы этого типа.